1-fundamentos_blog/blog/app/controllers/comments_controller.rb

    def create
        @comment = @post.comments.create(comment_params)
        @comment.user = current_user

        if @comment.save
---
INSERT INTO "comments" ("post_id", "user_id", "created_at", "updated_at") VALUES (4, 2, '2025-01-29 18:25:09.090437', '2025-01-29 18:25:09.090437') RETURNING "id"
UPDATE "comments" SET "updated_at" = '2025-01-29 18:25:09.124997' WHERE "comments"."id" = 1

    def destroy
        @comment = @post.comments.find(params[:id])
        @comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3 AND "comments"."id" = 3 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 3