1-fundamentos_blog/blog/app/controllers/posts_controller.rb

  def show
    @post.update(views: @post.views + 1)
    @comments = @post.comments.order(created_at: :desc)
---
UPDATE "posts" SET "updated_at" = '2025-01-29 15:41:02.058774', "views" = 1 WHERE "posts"."id" = 1
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 4 ORDER BY "comments"."created_at" DESC

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "views", "user_id") VALUES ('Post do Adm', 'glrtnhlunfodndftg tf h h', '2025-01-29 15:59:40.043749', '2025-01-29 15:59:40.043749', 0, 1) RETURNING "id"